---
kind: property
id: P:Autodesk.Revit.DB.TemporaryViewModes.RevealHiddenElements
source: html/87e6bdea-ffa7-fdf1-d190-db9ae56e9bb3.htm
---
# Autodesk.Revit.DB.TemporaryViewModes.RevealHiddenElements Property

The current state of the RevealHiddenElements mode in the associated view.

## Syntax (C#)
```csharp
public bool RevealHiddenElements { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: The RevealHiddenElements mode is either disabled or inapplicable in the associated view.